### Terraform Initialization `success`

### Terraform Validation `success`

<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

### Terraform Plan `success`

<details><summary>Show Plan</summary>

```


Terraform used the selected providers to generate the following execution
  + create
  - destroy

Terraform will perform the following actions:

  # google_compute_instance_from_template.vm-from-temp-prim-reg-prim-zone will be created
  + resource "google_compute_instance_from_template" "vm-from-temp-prim-reg-prim-zone" {
      + allow_stopping_for_update  = (known after apply)
      + can_ip_forward             = (known after apply)
      + cpu_platform               = (known after apply)
      + creation_timestamp         = (known after apply)
      + current_status             = (known after apply)
      + deletion_protection        = (known after apply)
      + description                = (known after apply)
      + desired_status             = (known after apply)
      + effective_labels           = {
          + "goog-terraform-provisioned" = "true"
        }
      + enable_display             = (known after apply)
      + hostname                   = (known after apply)
      + id                         = (known after apply)
      + instance_id                = (known after apply)
      + key_revocation_action_type = (known after apply)
      + label_fingerprint          = (known after apply)
      + labels                     = (known after apply)
      + machine_type               = (known after apply)
      + metadata                   = (known after apply)
      + metadata_fingerprint       = (known after apply)
      + metadata_startup_script    = (known after apply)
      + min_cpu_platform           = (known after apply)
      + name                       = "vm-dtppi-us-central1-a"
      + project                    = "chspoc-tppi-dev-producer"
      + resource_policies          = (known after apply)
      + self_link                  = (known after apply)
      + source_instance_template   = (known after apply)
      + tags                       = (known after apply)
      + tags_fingerprint           = (known after apply)
      + terraform_labels           = {
          + "goog-terraform-provisioned" = "true"
        }
      + zone                       = "us-central1-a"

      + advanced_machine_features (known after apply)

      + attached_disk (known after apply)

      + boot_disk (known after apply)

      + confidential_instance_config (known after apply)

      + guest_accelerator (known after apply)

      + instance_encryption_key (known after apply)

      + network_interface (known after apply)

      + network_performance_config (known after apply)

      + params (known after apply)

      + reservation_affinity (known after apply)

      + scheduling (known after apply)

      + scratch_disk (known after apply)

      + service_account (known after apply)
    }

  # google_compute_instance_from_template.vm-from-temp-prim-reg-sec-zone will be created
  + resource "google_compute_instance_from_template" "vm-from-temp-prim-reg-sec-zone" {
      + allow_stopping_for_update  = (known after apply)
      + can_ip_forward             = (known after apply)
      + cpu_platform               = (known after apply)
      + creation_timestamp         = (known after apply)
      + current_status             = (known after apply)
      + deletion_protection        = (known after apply)
      + description                = (known after apply)
      + desired_status             = (known after apply)
      + effective_labels           = {
          + "goog-terraform-provisioned" = "true"
        }
      + enable_display             = (known after apply)
      + hostname                   = (known after apply)
      + id                         = (known after apply)
      + instance_id                = (known after apply)
      + key_revocation_action_type = (known after apply)
      + label_fingerprint          = (known after apply)
      + labels                     = (known after apply)
      + machine_type               = (known after apply)
      + metadata                   = (known after apply)
      + metadata_fingerprint       = (known after apply)
      + metadata_startup_script    = (known after apply)
      + min_cpu_platform           = (known after apply)
      + name                       = "vm-dtppi-us-central1-b"
      + project                    = "chspoc-tppi-dev-producer"
      + resource_policies          = (known after apply)
      + self_link                  = (known after apply)
      + source_instance_template   = (known after apply)
      + tags                       = (known after apply)
      + tags_fingerprint           = (known after apply)
      + terraform_labels           = {
          + "goog-terraform-provisioned" = "true"
        }
      + zone                       = "us-central1-b"

      + advanced_machine_features (known after apply)

      + attached_disk (known after apply)

      + boot_disk (known after apply)

      + confidential_instance_config (known after apply)

      + guest_accelerator (known after apply)

      + instance_encryption_key (known after apply)

      + network_interface (known after apply)

      + network_performance_config (known after apply)

      + params (known after apply)

      + reservation_affinity (known after apply)

      + scheduling (known after apply)

      + scratch_disk (known after apply)

      + service_account (known after apply)
    }

  # google_compute_instance_group.umig-dev-prim-reg-prim-zone will be created
  + resource "google_compute_instance_group" "umig-dev-prim-reg-prim-zone" {
      + description = "Terraform test instance group"
      + id          = (known after apply)
      + instances   = (known after apply)
      + name        = "ceigu-dtppi-us-central1-a"
      + network     = (known after apply)
      + project     = "chspoc-tppi-dev-producer"
      + self_link   = (known after apply)
      + size        = (known after apply)
      + zone        = "us-central1-a"
    }

  # google_compute_instance_group.umig-dev-prim-reg-sec-zone will be created
  + resource "google_compute_instance_group" "umig-dev-prim-reg-sec-zone" {
      + description = "Terraform test instance group"
      + id          = (known after apply)
      + instances   = (known after apply)
      + name        = "ceigu-dtppi-us-central1-b"
      + network     = (known after apply)
      + project     = "chspoc-tppi-dev-producer"
      + self_link   = (known after apply)
      + size        = (known after apply)
      + zone        = "us-central1-b"
    }

  # google_compute_network.tppi_dev_vpc_data will be created
  + resource "google_compute_network" "tppi_dev_vpc_data" {
      + auto_create_subnetworks                   = false
      + bgp_always_compare_med                    = (known after apply)
      + bgp_best_path_selection_mode              = (known after apply)
      + bgp_inter_region_cost                     = (known after apply)
      + delete_default_routes_on_create           = false
      + gateway_ipv4                              = (known after apply)
      + id                                        = (known after apply)
      + internal_ipv6_range                       = (known after apply)
      + mtu                                       = 1856
      + name                                      = "vpc-dev-tppi-data"
      + network_firewall_policy_enforcement_order = "BEFORE_CLASSIC_FIREWALL"
      + network_id                                = (known after apply)
      + numeric_id                                = (known after apply)
      + project                                   = "tppi-dev-producer"
      + routing_mode                              = (known after apply)
      + self_link                                 = (known after apply)
    }

  # google_compute_network.tppi_dev_vpc_mgmt will be created
  + resource "google_compute_network" "tppi_dev_vpc_mgmt" {
      + auto_create_subnetworks                   = false
      + bgp_always_compare_med                    = (known after apply)
      + bgp_best_path_selection_mode              = (known after apply)
      + bgp_inter_region_cost                     = (known after apply)
      + delete_default_routes_on_create           = false
      + gateway_ipv4                              = (known after apply)
      + id                                        = (known after apply)
      + internal_ipv6_range                       = (known after apply)
      + mtu                                       = 1856
      + name                                      = "vpc-dev-tppi-mgmt"
      + network_firewall_policy_enforcement_order = "BEFORE_CLASSIC_FIREWALL"
      + network_id                                = (known after apply)
      + numeric_id                                = (known after apply)
      + project                                   = "tppi-dev-producer"
      + routing_mode                              = (known after apply)
      + self_link                                 = (known after apply)
    }

  # google_compute_subnetwork.tppi_d_primary_sbnt_data will be created
  + resource "google_compute_subnetwork" "tppi_d_primary_sbnt_data" {
      + creation_timestamp         = (known after apply)
      + enable_flow_logs           = (known after apply)
      + external_ipv6_prefix       = (known after apply)
      + fingerprint                = (known after apply)
      + gateway_address            = (known after apply)
      + id                         = (known after apply)
      + internal_ipv6_prefix       = (known after apply)
      + ip_cidr_range              = "10.3.50.0/24"
      + ipv6_cidr_range            = (known after apply)
      + ipv6_gce_endpoint          = (known after apply)
      + name                       = "vpcs-d-tppi-data-usc1-a"
      + network                    = (known after apply)
      + private_ip_google_access   = true
      + private_ipv6_google_access = (known after apply)
      + project                    = "tppi-dev-producer"
      + purpose                    = (known after apply)
      + region                     = "us-central1"
      + self_link                  = (known after apply)
      + stack_type                 = (known after apply)
      + state                      = (known after apply)
      + subnetwork_id              = (known after apply)

      + secondary_ip_range (known after apply)
    }

  # google_compute_subnetwork.tppi_d_primary_sbnt_mgmt will be created
  + resource "google_compute_subnetwork" "tppi_d_primary_sbnt_mgmt" {
      + creation_timestamp         = (known after apply)
      + enable_flow_logs           = (known after apply)
      + external_ipv6_prefix       = (known after apply)
      + fingerprint                = (known after apply)
      + gateway_address            = (known after apply)
      + id                         = (known after apply)
      + internal_ipv6_prefix       = (known after apply)
      + ip_cidr_range              = "10.3.40.0/24"
      + ipv6_cidr_range            = (known after apply)
      + ipv6_gce_endpoint          = (known after apply)
      + name                       = "vpcs-d-tppi-mgmt-usc1-a"
      + network                    = (known after apply)
      + private_ip_google_access   = true
      + private_ipv6_google_access = (known after apply)
      + project                    = "tppi-dev-producer"
      + purpose                    = (known after apply)
      + region                     = "us-central1"
      + self_link                  = (known after apply)
      + stack_type                 = (known after apply)
      + state                      = (known after apply)
      + subnetwork_id              = (known after apply)

      + secondary_ip_range (known after apply)
    }

  # google_network_connectivity_spoke.test-spoke will be destroyed
  # (because google_network_connectivity_spoke.test-spoke is not in configuration)
  - resource "google_network_connectivity_spoke" "test-spoke" {
      - create_time      = "2025-10-02T12:36:49.269642994Z" -> null
      - description      = "NCC Spoke - Transit QA - Managed by Terraform" -> null
      - effective_labels = {
          - "environment"                = "qa"
          - "goog-terraform-provisioned" = "true"
          - "scope"                      = "ncc-qa"
        } -> null
      - group            = "projects/chspoc-qa-core-prj/locations/global/hubs/ncc-qa-hub/groups/center" -> null
      - hub              = "projects/chspoc-qa-core-prj/locations/global/hubs/ncc-qa-hub" -> null
      - id               = "projects/chspoc-qa-core-prj/locations/global/spokes/test-active-terraform" -> null
      - labels           = {
          - "environment" = "qa"
          - "scope"       = "ncc-qa"
        } -> null
      - location         = "global" -> null
      - name             = "projects/chspoc-qa-core-prj/locations/global/spokes/test-active-terraform" -> null
      - project          = "chspoc-qa-core-prj" -> null
      - reasons          = [
          - {
              - code         = "PENDING_REVIEW"
              - message      = "Spoke is Pending Review"
                # (1 unchanged attribute hidden)
            },
        ] -> null
      - state            = "INACTIVE" -> null
      - terraform_labels = {
          - "environment"                = "qa"
          - "goog-terraform-provisioned" = "true"
          - "scope"                      = "ncc-qa"
        } -> null
      - unique_id        = "d708b293-f291-4c81-b158-07d98830480d" -> null
      - update_time      = "2025-10-02T12:36:57.386963637Z" -> null

      - linked_vpc_network {
          - exclude_export_ranges = [] -> null
          - include_export_ranges = [] -> null
          - uri                   = "https://www.googleapis.com/compute/v1/projects/chspoc-qa-core-prj/global/networks/vpc-test-spoke" -> null
        }
    }

  # module.peering-ulan1-fw_mgmt.google_compute_network_peering.local_network_peering will be created
  + resource "google_compute_network_peering" "local_network_peering" {
      + export_custom_routes                = true
      + export_subnet_routes_with_public_ip = false
      + id                                  = (known after apply)
      + import_custom_routes                = true
      + import_subnet_routes_with_public_ip = false
      + name                                = (known after apply)
      + network                             = "https://www.googleapis.com/compute/v1/projects/chspoc-landing-prj/global/networks/vpc-ulan1"
      + peer_network                        = (known after apply)
      + stack_type                          = "IPV4_ONLY"
      + state                               = (known after apply)
      + state_details                       = (known after apply)
    }

  # module.peering-ulan1-fw_mgmt.google_compute_network_peering.peer_network_peering[0] will be created
  + resource "google_compute_network_peering" "peer_network_peering" {
      + export_custom_routes                = true
      + export_subnet_routes_with_public_ip = false
      + id                                  = (known after apply)
      + import_custom_routes                = true
      + import_subnet_routes_with_public_ip = false
      + name                                = (known after apply)
      + network                             = (known after apply)
      + peer_network                        = "https://www.googleapis.com/compute/v1/projects/chspoc-landing-prj/global/networks/vpc-ulan1"
      + stack_type                          = "IPV4_ONLY"
      + state                               = (known after apply)
      + state_details                       = (known after apply)
    }

  # module.tppi-dev-ilb-primary.google_compute_forwarding_rule.default["nfr-dtppi-usc1-1-1"] will be created
  + resource "google_compute_forwarding_rule" "default" {
      + allow_global_access   = true
      + backend_service       = (known after apply)
      + base_forwarding_rule  = (known after apply)
      + creation_timestamp    = (known after apply)
      + effective_labels      = (known after apply)
      + forwarding_rule_id    = (known after apply)
      + id                    = (known after apply)
      + ip_address            = (known after apply)
      + ip_protocol           = "UDP"
      + ip_version            = "IPV4"
      + label_fingerprint     = (known after apply)
      + load_balancing_scheme = "INTERNAL"
      + name                  = "ilb-dev-tppi-us-central1-nfr-dtppi-usc1-1-1"
      + network               = (known after apply)
      + network_tier          = (known after apply)
      + port_range            = (known after apply)
      + ports                 = [
          + "6081",
        ]
      + project               = "chspoc-tppi-dev-producer"
      + psc_connection_id     = (known after apply)
      + psc_connection_status = (known after apply)
      + recreate_closed_psc   = false
      + region                = "us-central1"
      + self_link             = (known after apply)
      + service_label         = "ilb-dev-tppi-us-central1"
      + service_name          = (known after apply)
      + subnetwork            = (known after apply)
      + terraform_labels      = (known after apply)

      + service_directory_registrations (known after apply)
    }

  # module.tppi-dev-ilb-primary.google_compute_forwarding_rule.default["nfr-dtppi-usc1-1-2"] will be created
  + resource "google_compute_forwarding_rule" "default" {
      + allow_global_access   = true
      + backend_service       = (known after apply)
      + base_forwarding_rule  = (known after apply)
      + creation_timestamp    = (known after apply)
      + effective_labels      = (known after apply)
      + forwarding_rule_id    = (known after apply)
      + id                    = (known after apply)
      + ip_address            = (known after apply)
      + ip_protocol           = "UDP"
      + ip_version            = "IPV4"
      + label_fingerprint     = (known after apply)
      + load_balancing_scheme = "INTERNAL"
      + name                  = "ilb-dev-tppi-us-central1-nfr-dtppi-usc1-1-2"
      + network               = (known after apply)
      + network_tier          = (known after apply)
      + port_range            = (known after apply)
      + ports                 = [
          + "6081",
        ]
      + project               = "chspoc-tppi-dev-producer"
      + psc_connection_id     = (known after apply)
      + psc_connection_status = (known after apply)
      + recreate_closed_psc   = false
      + region                = "us-central1"
      + self_link             = (known after apply)
      + service_label         = "ilb-dev-tppi-us-central1"
      + service_name          = (known after apply)
      + subnetwork            = (known after apply)
      + terraform_labels      = (known after apply)

      + service_directory_registrations (known after apply)
    }

  # module.tppi-dev-ilb-primary.google_compute_health_check.default[0] will be created
  + resource "google_compute_health_check" "default" {
      + check_interval_sec  = 5
      + creation_timestamp  = (known after apply)
      + description         = "Terraform managed."
      + healthy_threshold   = 2
      + id                  = (known after apply)
      + name                = "hc-tcp-usc1-80-i5s-t5s-h2-u2"
      + project             = "chspoc-tppi-dev-producer"
      + self_link           = (known after apply)
      + timeout_sec         = 5
      + type                = (known after apply)
      + unhealthy_threshold = 2

      + http_health_check {
          + port         = 80
          + proxy_header = "NONE"
          + request_path = "/"
        }

      + log_config (known after apply)
    }

  # module.tppi-dev-ilb-primary.google_compute_region_backend_service.default will be created
  + resource "google_compute_region_backend_service" "default" {
      + connection_draining_timeout_sec = 300
      + creation_timestamp              = (known after apply)
      + description                     = "Terraform managed."
      + fingerprint                     = (known after apply)
      + generated_id                    = (known after apply)
      + health_checks                   = (known after apply)
      + id                              = (known after apply)
      + load_balancing_scheme           = "INTERNAL"
      + name                            = "nbs-dtppi-usc1-1"
      + network                         = (known after apply)
      + port_name                       = (known after apply)
      + project                         = "chspoc-tppi-dev-producer"
      + protocol                        = "UDP"
      + region                          = "us-central1"
      + self_link                       = (known after apply)
      + session_affinity                = (known after apply)
      + timeout_sec                     = (known after apply)

      + backend (known after apply)

      + cdn_policy (known after apply)

      + iap {
          + enabled                     = false
          + oauth2_client_secret_sha256 = (sensitive value)
        }

      + log_config (known after apply)
    }

  # module.tppi-dev-vm-prim-reg-prim-zone-template.google_compute_instance_template.default[0] will be created
  + resource "google_compute_instance_template" "default" {
      + can_ip_forward       = false
      + creation_timestamp   = (known after apply)
      + description          = "Managed by the compute-vm Terraform module."
      + effective_labels     = {
          + "goog-terraform-provisioned" = "true"
        }
      + id                   = (known after apply)
      + machine_type         = "n2-standard-2"
      + metadata_fingerprint = (known after apply)
      + name                 = (known after apply)
      + name_prefix          = (known after apply)
      + numeric_id           = (known after apply)
      + project              = "chspoc-tppi-dev-producer"
      + region               = "us-central1"
      + self_link            = (known after apply)
      + self_link_unique     = (known after apply)
      + tags                 = [
          + "tppi-instance",
        ]
      + tags_fingerprint     = (known after apply)
      + terraform_labels     = {
          + "goog-terraform-provisioned" = "true"
        }

      + confidential_instance_config (known after apply)

      + disk {
          + architecture           = (known after apply)
          + auto_delete            = true
          + boot                   = true
          + device_name            = (known after apply)
          + disk_size_gb           = 10
          + disk_type              = "pd-balanced"
          + interface              = (known after apply)
          + mode                   = (known after apply)
          + provisioned_iops       = (known after apply)
          + provisioned_throughput = (known after apply)
          + source_image           = "projects/paloaltonetworksgcp-public/global/images/vmseries-flex-bundle3-1126"
          + type                   = (known after apply)
        }

      + network_interface {
          + internal_ipv6_prefix_length = (known after apply)
          + ipv6_access_type            = (known after apply)
          + ipv6_address                = (known after apply)
          + name                        = (known after apply)
          + network                     = (known after apply)
          + network_attachment          = (known after apply)
          + stack_type                  = (known after apply)
          + subnetwork                  = (known after apply)
          + subnetwork_project          = (known after apply)
        }
      + network_interface {
          + internal_ipv6_prefix_length = (known after apply)
          + ipv6_access_type            = (known after apply)
          + ipv6_address                = (known after apply)
          + name                        = (known after apply)
          + network                     = (known after apply)
          + network_attachment          = (known after apply)
          + stack_type                  = (known after apply)
          + subnetwork                  = (known after apply)
          + subnetwork_project          = (known after apply)
        }

      + scheduling {
          + automatic_restart   = true
          + on_host_maintenance = "MIGRATE"
          + preemptible         = false
          + provisioning_model  = "STANDARD"
        }

      + service_account {
          + email  = (known after apply)
          + scopes = [
              + "https://www.googleapis.com/auth/devstorage.read_only",
              + "https://www.googleapis.com/auth/logging.write",
              + "https://www.googleapis.com/auth/monitoring.write",
            ]
        }
    }

  # module.tppi-dev-vm-prim-reg-sec-zone-template.google_compute_instance_template.default[0] will be created
  + resource "google_compute_instance_template" "default" {
      + can_ip_forward       = false
      + creation_timestamp   = (known after apply)
      + description          = "Managed by the compute-vm Terraform module."
      + effective_labels     = {
          + "goog-terraform-provisioned" = "true"
        }
      + id                   = (known after apply)
      + machine_type         = "n2-standard-2"
      + metadata_fingerprint = (known after apply)
      + name                 = (known after apply)
      + name_prefix          = (known after apply)
      + numeric_id           = (known after apply)
      + project              = "chspoc-tppi-dev-producer"
      + region               = "us-central1"
      + self_link            = (known after apply)
      + self_link_unique     = (known after apply)
      + tags                 = [
          + "tppi-instance",
        ]
      + tags_fingerprint     = (known after apply)
      + terraform_labels     = {
          + "goog-terraform-provisioned" = "true"
        }

      + confidential_instance_config (known after apply)

      + disk {
          + architecture           = (known after apply)
          + auto_delete            = true
          + boot                   = true
          + device_name            = (known after apply)
          + disk_size_gb           = 10
          + disk_type              = "pd-balanced"
          + interface              = (known after apply)
          + mode                   = (known after apply)
          + provisioned_iops       = (known after apply)
          + provisioned_throughput = (known after apply)
          + source_image           = "projects/paloaltonetworksgcp-public/global/images/vmseries-flex-bundle3-1126"
          + type                   = (known after apply)
        }

      + network_interface {
          + internal_ipv6_prefix_length = (known after apply)
          + ipv6_access_type            = (known after apply)
          + ipv6_address                = (known after apply)
          + name                        = (known after apply)
          + network                     = (known after apply)
          + network_attachment          = (known after apply)
          + stack_type                  = (known after apply)
          + subnetwork                  = (known after apply)
          + subnetwork_project          = (known after apply)
        }
      + network_interface {
          + internal_ipv6_prefix_length = (known after apply)
          + ipv6_access_type            = (known after apply)
          + ipv6_address                = (known after apply)
          + name                        = (known after apply)
          + network                     = (known after apply)
          + network_attachment          = (known after apply)
          + stack_type                  = (known after apply)
          + subnetwork                  = (known after apply)
          + subnetwork_project          = (known after apply)
        }

      + scheduling {
          + automatic_restart   = true
          + on_host_maintenance = "MIGRATE"
          + preemptible         = false
          + provisioning_model  = "STANDARD"
        }

      + service_account {
          + email  = (known after apply)
          + scopes = [
              + "https://www.googleapis.com/auth/devstorage.read_only",
              + "https://www.googleapis.com/auth/logging.write",
              + "https://www.googleapis.com/auth/monitoring.write",
            ]
        }
    }

  # module.tppi_dev_project.google_project.project[0] will be created
  + resource "google_project" "project" {
      + auto_create_network = false
      + billing_account     = "019AF3-3082AF-842582"
      + deletion_policy     = "DELETE"
      + effective_labels    = {
          + "goog-terraform-provisioned" = "true"
        }
      + folder_id           = "146457895233"
      + id                  = (known after apply)
      + name                = "chspoc-tppi-dev-producer"
      + number              = (known after apply)
      + project_id          = "chspoc-tppi-dev-producer"
      + terraform_labels    = {
          + "goog-terraform-provisioned" = "true"
        }
    }

  # module.tppi_dev_project.google_project_iam_member.service_agents["compute-system"] will be created
  + resource "google_project_iam_member" "service_agents" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = (known after apply)
      + project = "chspoc-tppi-dev-producer"
      + role    = "roles/compute.serviceAgent"
    }

  # module.tppi_dev_project.google_project_iam_member.service_agents["monitoring-notification"] will be created
  + resource "google_project_iam_member" "service_agents" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = (known after apply)
      + project = "chspoc-tppi-dev-producer"
      + role    = "roles/monitoring.notificationServiceAgent"
    }

  # module.tppi_dev_project.google_project_iam_member.service_agents["networkmanagement"] will be created
  + resource "google_project_iam_member" "service_agents" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = (known after apply)
      + project = "chspoc-tppi-dev-producer"
      + role    = "roles/networkmanagement.serviceAgent"
    }

  # module.tppi_dev_project.google_project_iam_member.service_agents["service-networking"] will be created
  + resource "google_project_iam_member" "service_agents" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = (known after apply)
      + project = "chspoc-tppi-dev-producer"
      + role    = "roles/servicenetworking.serviceAgent"
    }

  # module.tppi_dev_project.google_project_iam_member.service_agents["vpcaccess"] will be created
  + resource "google_project_iam_member" "service_agents" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = (known after apply)
      + project = "chspoc-tppi-dev-producer"
      + role    = "roles/vpcaccess.serviceAgent"
    }

  # module.tppi_dev_project.google_project_service.project_services["compute.googleapis.com"] will be created
  + resource "google_project_service" "project_services" {
      + disable_dependent_services = false
      + disable_on_destroy         = false
      + id                         = (known after apply)
      + project                    = "chspoc-tppi-dev-producer"
      + service                    = "compute.googleapis.com"
    }

  # module.tppi_dev_project.google_project_service.project_services["logging.googleapis.com"] will be created
  + resource "google_project_service" "project_services" {
      + disable_dependent_services = false
      + disable_on_destroy         = false
      + id                         = (known after apply)
      + project                    = "chspoc-tppi-dev-producer"
      + service                    = "logging.googleapis.com"
    }

  # module.tppi_dev_project.google_project_service.project_services["monitoring.googleapis.com"] will be created
  + resource "google_project_service" "project_services" {
      + disable_dependent_services = false
      + disable_on_destroy         = false
      + id                         = (known after apply)
      + project                    = "chspoc-tppi-dev-producer"
      + service                    = "monitoring.googleapis.com"
    }

  # module.tppi_dev_project.google_project_service.project_services["networkmanagement.googleapis.com"] will be created
  + resource "google_project_service" "project_services" {
      + disable_dependent_services = false
      + disable_on_destroy         = false
      + id                         = (known after apply)
      + project                    = "chspoc-tppi-dev-producer"
      + service                    = "networkmanagement.googleapis.com"
    }

  # module.tppi_dev_project.google_project_service.project_services["networksecurity.googleapis.com"] will be created
  + resource "google_project_service" "project_services" {
      + disable_dependent_services = false
      + disable_on_destroy         = false
      + id                         = (known after apply)
      + project                    = "chspoc-tppi-dev-producer"
      + service                    = "networksecurity.googleapis.com"
    }

  # module.tppi_dev_project.google_project_service.project_services["servicenetworking.googleapis.com"] will be created
  + resource "google_project_service" "project_services" {
      + disable_dependent_services = false
      + disable_on_destroy         = false
      + id                         = (known after apply)
      + project                    = "chspoc-tppi-dev-producer"
      + service                    = "servicenetworking.googleapis.com"
    }

  # module.tppi_dev_project.google_project_service.project_services["vpcaccess.googleapis.com"] will be created
  + resource "google_project_service" "project_services" {
      + disable_dependent_services = false
      + disable_on_destroy         = false
      + id                         = (known after apply)
      + project                    = "chspoc-tppi-dev-producer"
      + service                    = "vpcaccess.googleapis.com"
    }

  # module.tppi_dev_project.google_project_service_identity.default["monitoring.googleapis.com"] will be created
  + resource "google_project_service_identity" "default" {
      + email   = (known after apply)
      + id      = (known after apply)
      + member  = (known after apply)
      + project = "chspoc-tppi-dev-producer"
      + service = "monitoring.googleapis.com"
    }

  # module.tppi_dev_project.google_project_service_identity.default["networkmanagement.googleapis.com"] will be created
  + resource "google_project_service_identity" "default" {
      + email   = (known after apply)
      + id      = (known after apply)
      + member  = (known after apply)
      + project = "chspoc-tppi-dev-producer"
      + service = "networkmanagement.googleapis.com"
    }

  # module.tppi_dev_project.google_project_service_identity.default["networksecurity.googleapis.com"] will be created
  + resource "google_project_service_identity" "default" {
      + email   = (known after apply)
      + id      = (known after apply)
      + member  = (known after apply)
      + project = "chspoc-tppi-dev-producer"
      + service = "networksecurity.googleapis.com"
    }

  # module.tppi_dev_project.google_project_service_identity.default["servicenetworking.googleapis.com"] will be created
  + resource "google_project_service_identity" "default" {
      + email   = (known after apply)
      + id      = (known after apply)
      + member  = (known after apply)
      + project = "chspoc-tppi-dev-producer"
      + service = "servicenetworking.googleapis.com"
    }

  # module.tppi_dev_project.google_project_service_identity.default["vpcaccess.googleapis.com"] will be created
  + resource "google_project_service_identity" "default" {
      + email   = (known after apply)
      + id      = (known after apply)
      + member  = (known after apply)
      + project = "chspoc-tppi-dev-producer"
      + service = "vpcaccess.googleapis.com"
    }

Plan: 34 to add, 0 to change, 1 to destroy.

Warning: Value for undeclared variable

The root module does not declare a variable named "stage_configs" but a value

To silence these warnings, use TF_VAR_... environment variables to provide

Warning: Value for undeclared variable

The root module does not declare a variable named "service_accounts" but a

To silence these warnings, use TF_VAR_... environment variables to provide

Warning: Values for undeclared variables

In addition to the other similar warnings shown, 6 other variable(s) defined


Saved the plan to: ../plan.out

To perform exactly these actions, run the following command to apply:
    terraform apply "../plan.out"
```

</details>

### Terraform Apply `skipped`

*Pusher: @leorocca-gg, Action: `pull_request`, Working Directory: ``, Workflow: `FAST networking stage`*